SpecialChar = {}



/**********************************************************************************************
작성자   : shimpark
작성일자 : 2011-04-14
작성목적 : 데이터 초기화 // 데이터베이스로부터 출력할 데이터를 가져와서 출력하는 메서드
**********************************************************************************************/

$(function () {

    $(document).ready(function () {

        //닫기
        $('#CbtnClose').click(function (e) {
            e.preventDefault();
            if (parent.disablePopup) { parent.disablePopup(); } else { self.close(); }
        });

    });

});

/**********************************************************************************************
작성자   : shimpark
작성목적 : 이모티콘,특수문자에서 비주얼폰으로 옮기기
**********************************************************************************************/
SpecialChar.AddChar = function (ch) {
    if (parent.SendSMS) {
        parent.SendSMS.AddChar(ch);
    }
    else {
        opener.SendSMS.AddChar(ch);
    }
}
